//ZATLAS1C JOB (12345678),ZATLAS1,MSGCLASS=H,REGION=0M,
//        MSGLEVEL=(1,1),CLASS=A,NOTIFY=&SYSUID
//*ASM     EXEC PGM=ASMA90                                              00030000
//*******************************************************               00330001
//DELETE  EXEC PGM=IDCAMS
//SYSPRINT DD  DUMMY
//SYSIN    DD  *
 DELETE  (ZATLAS1.REXX.OUTPUT)
 SET MAXCC = 0
//*******************************************************               00360001
//CREATE  EXEC PGM=IEFBR14
//DCBOUT   DD  DSN=ZATLAS1.REXX.OUTPUT,
//             DISP=(NEW,CATLG,DELETE),
//             DCB=(DSORG=PS,RECFM=FB,LRECL=80),
//             UNIT=SYSDA,SPACE=(TRK,(5,5))
//*******************************************************               00360001
//RUNIT   EXEC PGM=IRXJCL,PARM='TRYPCRE1',COND=(0,NE)                   00339602
//STEPLIB  DD  DISP=SHR,DSN=ZATLAS1.PCRE2.LOADLIB                       00339703
//         DD  DISP=SHR,DSN=ZATLAS1.PCRE2.LOADLIB                       00339703
//SYSEXEC  DD  DISP=SHR,DSN=ZATLAS1.PCRE2.CNTLLIB                       00339801
//SYSIN    DD  *                                                        00339901
//SYSPRINT DD  SYSOUT=*                                                 00353001
//SYSTSPRT DD  SYSOUT=*                                                 00354001
//PCREDUMP DD  DISP=MOD,DSN=ZATLAS1.REXX.OUTPUT

